### Configuring Router Device Name: 

```commandline
Router(config)# hostname nameOfTheHost
```

### Securing privileged EXEC mode:

```cmd
Router(config)# enable secrect password
```

### Securing User Exec Mode: 
```commandline
Router(config)# line console 0
Router(command-line)# password password
Router(command-line)# login
```

### Logging into a remote system via Telnet or SSH access:

```cmd
Router(config)# line vty 0 4
Router(command-line)# password password
Router(command-line)# login
Router(command-line)# transport input {ssh | telnet}
```

In the commands above, 'transport input {ssh | telnet}' is used to specify which protocol to use for connecting into a remote system, SSH or Telnet.

### Encrypting All Plain Text Passwords: 
```commandline
Router(config)# service password encryption
```

### Displaying a text message and saving configuration:

```commandline
Router(config)# banner motd # message #
Router(config)# end 
Router# copy running-config startup-config
```
